{
  "classes": [
    {
      "id": 1,
      "name": "Fighter",
      "description": "Masters of weapons and armor...",
      "hitDie": "1d10",
      "primaryAbility": "Strength, Dexterity",
      "savingThrows": ["Strength", "Constitution"],
      "skills": ["Acrobatics", "Animal Handling", "Athletics", "History", "Insight", "Intimidation", "Perception", "Survival"],
      "numberOfSkills": 2,
      "armorProficiencies": ["All armor", "Shields"],
      "weaponProficiencies": ["Simple weapons", "Martial weapons"],
      "levels": [
        {
          "level": 1,
          "features": [
            {
              "name": "Fighting Style",
              "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. Archery (PHB). You gain a +2 bonus to attack rolls you make with ranged weapons. Blind Fighting (TCE). You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Additionally, you can see an invisible creature within that range, unless the creature successfully hides from you. Defense (PHB). While you are wearing armor, you gain a +1 bonus to AC. Dueling (PHB). When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. Great Weapon Fighting (PHB). When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit. Interception (TCE). When a creature you can see hits a target that is within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction. Protection (PHB). When a creature you can see attacks a target that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. Superior Technique (TCE). You learn one maneuver of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice). You gain one superiority die, which is a d6 (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain expended superiority dice when you finish a short or long rest. Thrown Weapon Fighting (TCE). You can draw a weapon that has the thrown property as part of the attack you make with the weapon. In addition, when you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll. Two-Weapon Fighting (PHB). When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack. Unarmed Fighting (TCE). Your unarmed strikes can deal bludgeoning damage equal to 1d6 + your Strength modifier on a hit. If you're not wielding any weapons or a shield when you make the attack roll, the d6 becomes a d8. At the start of each of your turns, you can deal 1d4 bludgeoning damage to one creature grappled by you."
            },
            {
              "name": "Second Wind",
              "description": "You have a limited source of resilience that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
            }
          ]
        },
        {
          "level": 2,
          "features": [
            {
              "name": "Action Surge",
              "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "name": "Paladin",
      "description": "Powerful warriors capable of invoking divine powers, but bound by an oath...",
      "hitDie": "1d10",
      "primaryAbility": "Strength, Charisma",
      "savingThrows": ["Wisdom", "Charisma"],
      "skills": ["Athletics", "Insight", "Intimidation", "Medicine", "Persuasion", "Religion"],
      "numberOfSkills": 2,
      "armorProficiencies": ["All armor", "Shields"],
      "weaponProficiencies": ["Simple weapons", "Martial weapons"],
      "levels": [
        {
          "level": 1,
          "features": [
            {
              "name": "Lay on Hands",
              "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum remaining in the pool. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison afflicting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, spending hit points separately for each one. This feature has no effect on undead and constructs."
            },
            {
              "name": "Divine Sense",
              "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
            }
          ]
        },
        {
          "level": 2,
          "features": [
            {
              "name": "Spellcasting",
              "description": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. Preparing and Casting Spells The Paladin table shows how many spell slots you have to cast your paladin spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the paladin spells you are able to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st- or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. Spellcasting Ability Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one. Spell save DC = 8 + your proficiency bonus + your Charisma modifier Spell attack modifier = your proficiency bonus + your Charisma modifier Spellcasting Focus You can use a holy symbol as a spellcasting focus for your paladin spells."
            },
            {
              "name": "Fighting Style",
              "description": "Starting at 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. Blessed Warrior. You learn two cantrips of your choice from the cleric spell list. They count as paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the cleric spell list. Blind Fighting. You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Additionally, you can see an invisible creature within that range, unless the creature successfully hides from you. Defense. While you are wearing armor, you gain a +1 bonus to AC. Dueling. When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. Great Weapon Fighting. When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit. Interception. When a creature you can see hits a target that is within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction. Protection. When a creature you can see attacks a target that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
            }
          ]
        }
      ]
    }
  ],
  "races": [
    {
      "id": 1,
      "name": "Human",
      "description": "Versatile and ambitious...",
      "speed": 30,
      "abilityBonuses": "+1 to all"
    },
    {
      "id": 2,
      "name": "Orc",
      "description": "Fierce warriors hard to kill...",
      "speed": 30,
      "abilityBonuses": "+2 Strength, +1 Constitution"
    }
  ],
  "spells": [
    {
      "id": 1,
      "name": "Fire Bolt",
      "level": 0,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "concentration": false,
      "description": "You hurl a mote of fire at a target. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried. At Higher Levels. The damage of this spell increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "spellLists": "Artificer, Sorcerer, Wizard"
    },
    {
      "id": 2,
      "name": "Friends",
      "level": 0,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M (a small amount of makeup applied while casting)",
      "duration": "1 minute",
      "concentration": true,
      "description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes you used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM's discretion), depending on the nature of your interaction with it.",
      "spellLists": "Bard, Warlock, Sorcerer, Wizard"
    },
    {
      "id": 3,
      "name": "Cure Wounds",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "concentration": false,
      "description": "A creature you touch regains hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.",
      "spellLists": "Artificer, Bard, Cleric, Druid, Ranger, Paladin"
    },
    {
      "id": 4,
      "name": "Charm Person",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 hour",
      "concentration": false,
      "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and it does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do something harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
      "spellLists": "Bard, Warlock, Druid, Sorcerer, Wizard"
    },
    {
      "id": 5,
      "name": "Aid",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M (a tiny strip of white cloth)",
      "duration": "8 hours",
      "concentration": false,
      "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. The hit point maximum and current hit points of each target increase by 5 for the duration. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by 5 additional for each slot level above 2nd.",
      "spellLists": "Artificer, Bard, Cleric, Ranger, Paladin"
    },
    {
      "id": 6,
      "name": "Darkvision",
      "level": 2,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M (either a pinch of dried carrot or an agate)",
      "duration": "8 hours",
      "concentration": false,
      "description": "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.",
      "spellLists": "Artificer, Druid, Sorcerer, Wizard, Ranger"
    }
  ]
}
